//gimmick_Chocoball
{
	D3DXVECTOR3(0.00f, 0.00f, -10.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR_00
{
	D3DXVECTOR3(0.00f, 0.80f, -5.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor_00
{
	D3DXVECTOR3(-24.15f, 26.97f, 25.48f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(3.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	3,//ギミックタイプ
	3.00f,//最大移動量
},
//enemy_Bullet
{
	D3DXVECTOR3(-26.00f, 12.03f, 28.19f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_00
{
	D3DXVECTOR3(-28.53f, 11.51f, 33.40f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_01
{
	D3DXVECTOR3(-12.50f, 11.51f, 48.32f),             //平行移動
	D3DXQUATERNION(0.00, 0.64f, 0.00f, -0.77f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_02
{
	D3DXVECTOR3(2.67f, 11.61f, 30.10f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_03
{
	D3DXVECTOR3(-28.75f, 28.14f, 19.65f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_04
{
	D3DXVECTOR3(-27.76f, 28.14f, 19.65f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_05
{
	D3DXVECTOR3(-23.10f, 28.14f, 19.65f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_06
{
	D3DXVECTOR3(-24.06f, 28.14f, 19.65f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_07
{
	D3DXVECTOR3(-24.06f, 28.14f, 31.12f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_08
{
	D3DXVECTOR3(-23.10f, 28.14f, 31.12f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_09
{
	D3DXVECTOR3(-27.76f, 28.14f, 31.12f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_10
{
	D3DXVECTOR3(-28.75f, 28.14f, 31.12f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor_00
{
	D3DXVECTOR3(0.18f, 1.50f, -3.48f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 2.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
