//enemy_00
{
	D3DXVECTOR3(0.00f, 8.55f, -32.90f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_00
{
	D3DXVECTOR3(0.00f, 8.50f, -19.66f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_01
{
	D3DXVECTOR3(0.00f, 8.50f, -24.55f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_02
{
	D3DXVECTOR3(-0.40f, 18.40f, -22.70f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(0.00f, 13.70f, -21.40f),             //平行移動
	D3DXQUATERNION(0.71, 0.00f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(-26.06f, 19.79f, -46.10f),             //平行移動
	D3DXQUATERNION(0.00, -1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(-14.60f, 20.21f, -23.64f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, -0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_02 (1)
{
	D3DXVECTOR3(-25.96f, 20.65f, -55.28f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(9.01f, 19.36f, -22.82f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, -0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(-0.80f, 20.13f, -65.20f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(-9.76f, 20.02f, -72.32f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 
{
	D3DXVECTOR3(-14.25f, 20.08f, -72.37f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0
{
	D3DXVECTOR3(-25.95f, 19.92f, -51.29f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (1)
{
	D3DXVECTOR3(-25.82f, 20.42f, -36.33f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (1)
{
	D3DXVECTOR3(-10.65f, 20.05f, -75.05f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (2)
{
	D3DXVECTOR3(-14.80f, 20.13f, -74.26f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (2)
{
	D3DXVECTOR3(-18.28f, 20.40f, -72.24f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (3)
{
	D3DXVECTOR3(-20.67f, 20.25f, -27.02f),             //平行移動
	D3DXQUATERNION(0.00, -0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (4)
{
	D3DXVECTOR3(-20.46f, 20.14f, -24.25f),             //平行移動
	D3DXQUATERNION(0.00, -0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (5)
{
	D3DXVECTOR3(-13.06f, 20.03f, -25.01f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (6)
{
	D3DXVECTOR3(-13.06f, 20.01f, -21.35f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (3)
{
	D3DXVECTOR3(-12.63f, 20.05f, -23.16f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (7)
{
	D3DXVECTOR3(-16.14f, 20.17f, -22.59f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (8)
{
	D3DXVECTOR3(-17.15f, 20.32f, -24.79f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (9)
{
	D3DXVECTOR3(-21.78f, 20.20f, -68.76f),             //平行移動
	D3DXQUATERNION(0.00, 0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (10)
{
	D3DXVECTOR3(-23.70f, 20.02f, -69.80f),             //平行移動
	D3DXQUATERNION(0.00, 0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
