//enemy_bullet0
{
	D3DXVECTOR3(-16.18f, 11.40f, -28.98f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0
{
	D3DXVECTOR3(-0.47f, 0.99f, -10.23f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball0
{
	D3DXVECTOR3(-35.51f, 12.13f, -31.01f),             //平行移動
	D3DXQUATERNION(0.12, -0.38f, 0.05f, 0.92f ),    //回転
	D3DXVECTOR3(1.56f, 0.95f, 1.87f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball2
{
	D3DXVECTOR3(-49.06f, 22.53f, 47.07f),             //平行移動
	D3DXQUATERNION(0.18, 0.81f, -0.44f, 0.34f ),    //回転
	D3DXVECTOR3(1.01f, 1.14f, 0.89f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball1
{
	D3DXVECTOR3(-53.20f, 5.70f, -13.84f),             //平行移動
	D3DXQUATERNION(0.16, 0.84f, -0.35f, 0.39f ),    //回転
	D3DXVECTOR3(1.03f, 1.60f, 1.60f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor0
{
	D3DXVECTOR3(-51.20f, 7.65f, -15.69f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	2.00f,//最大移動量
},
//ChocoWall0
{
	D3DXVECTOR3(-12.79f, 16.86f, 65.03f),             //平行移動
	D3DXQUATERNION(0.04, 0.38f, 0.01f, 0.93f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall1
{
	D3DXVECTOR3(-26.21f, 20.81f, 56.10f),             //平行移動
	D3DXQUATERNION(0.08, 0.46f, -0.10f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball3
{
	D3DXVECTOR3(-23.97f, 27.37f, 61.02f),             //平行移動
	D3DXQUATERNION(-0.45, 0.09f, -0.89f, 0.01f ),    //回転
	D3DXVECTOR3(0.86f, 0.80f, 0.72f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball4
{
	D3DXVECTOR3(-22.07f, 22.83f, 93.87f),             //平行移動
	D3DXQUATERNION(-0.94, 0.02f, -0.35f, 0.01f ),    //回転
	D3DXVECTOR3(0.87f, 0.79f, 0.71f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball5
{
	D3DXVECTOR3(-30.58f, 21.45f, 85.25f),             //平行移動
	D3DXQUATERNION(-0.78, 0.04f, -0.62f, -0.06f ),    //回転
	D3DXVECTOR3(0.85f, 0.80f, 0.74f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-43.13f, 19.95f, 83.64f),             //平行移動
	D3DXQUATERNION(0.09, 0.09f, -0.70f, -0.70f ),    //回転
	D3DXVECTOR3(0.90f, 0.61f, 0.96f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor4
{
	D3DXVECTOR3(-52.09f, 20.14f, 84.07f),             //平行移動
	D3DXQUATERNION(0.00, 0.79f, 0.00f, 0.62f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor5
{
	D3DXVECTOR3(-56.69f, 22.05f, 82.75f),             //平行移動
	D3DXQUATERNION(0.00, 0.79f, 0.00f, 0.62f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor8
{
	D3DXVECTOR3(-61.37f, 24.43f, 81.37f),             //平行移動
	D3DXQUATERNION(0.00, 0.79f, 0.00f, 0.62f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6
{
	D3DXVECTOR3(-47.84f, 13.84f, 82.01f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7
{
	D3DXVECTOR3(-53.47f, 13.84f, 80.33f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall8
{
	D3DXVECTOR3(-58.25f, 13.94f, 78.97f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall9
{
	D3DXVECTOR3(-62.85f, 18.74f, 77.48f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall10
{
	D3DXVECTOR3(-48.78f, 13.84f, 81.71f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall11
{
	D3DXVECTOR3(-49.72f, 13.84f, 81.42f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall12
{
	D3DXVECTOR3(-50.65f, 13.84f, 81.22f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall13
{
	D3DXVECTOR3(-51.60f, 13.84f, 80.83f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall14
{
	D3DXVECTOR3(-52.53f, 13.84f, 80.63f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (6)
{
	D3DXVECTOR3(-54.41f, 13.84f, 80.04f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (7)
{
	D3DXVECTOR3(-55.35f, 13.84f, 79.74f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (8)
{
	D3DXVECTOR3(-56.29f, 13.84f, 79.45f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (9)
{
	D3DXVECTOR3(-57.22f, 13.94f, 79.25f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (10)
{
	D3DXVECTOR3(-59.09f, 18.74f, 78.66f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (11)
{
	D3DXVECTOR3(-60.13f, 18.74f, 78.38f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (12)
{
	D3DXVECTOR3(-61.07f, 18.64f, 78.08f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (13)
{
	D3DXVECTOR3(-62.01f, 18.74f, 77.79f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (14)
{
	D3DXVECTOR3(-63.89f, 18.64f, 77.20f),             //平行移動
	D3DXQUATERNION(-0.56, 0.42f, 0.42f, 0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (16)
{
	D3DXVECTOR3(-58.93f, 18.63f, 77.72f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (1)
{
	D3DXVECTOR3(-53.18f, 18.72f, 79.40f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (1)
{
	D3DXVECTOR3(-47.54f, 18.72f, 81.17f),             //平行移動
	D3DXQUATERNION(0.70, 0.10f, 0.10f, -0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (2)
{
	D3DXVECTOR3(-49.51f, 18.72f, 87.74f),             //平行移動
	D3DXQUATERNION(0.70, 0.10f, 0.10f, -0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (2)
{
	D3DXVECTOR3(-55.23f, 18.72f, 86.08f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (17)
{
	D3DXVECTOR3(-60.77f, 18.63f, 84.47f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (18)
{
	D3DXVECTOR3(-60.84f, 23.62f, 84.41f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (3)
{
	D3DXVECTOR3(-55.22f, 13.74f, 86.17f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (3)
{
	D3DXVECTOR3(-49.60f, 13.74f, 87.74f),             //平行移動
	D3DXQUATERNION(0.70, 0.10f, 0.10f, -0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (4)
{
	D3DXVECTOR3(-47.55f, 13.74f, 81.07f),             //平行移動
	D3DXQUATERNION(0.70, 0.10f, 0.10f, -0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (4)
{
	D3DXVECTOR3(-53.17f, 13.74f, 79.40f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (19)
{
	D3DXVECTOR3(-58.87f, 23.62f, 77.85f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (5)
{
	D3DXVECTOR3(-47.84f, 18.74f, 82.01f),             //平行移動
	D3DXQUATERNION(0.56, -0.42f, -0.42f, -0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (15)
{
	D3DXVECTOR3(-63.88f, 23.64f, 77.30f),             //平行移動
	D3DXQUATERNION(-0.56, 0.42f, 0.42f, 0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (20)
{
	D3DXVECTOR3(-59.19f, 23.64f, 78.67f),             //平行移動
	D3DXQUATERNION(-0.56, 0.42f, 0.42f, 0.57f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR1 (1)
{
	D3DXVECTOR3(-49.93f, 18.64f, 84.86f),             //平行移動
	D3DXQUATERNION(0.00, 0.16f, 0.00f, -0.99f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_jump0
{
	D3DXVECTOR3(-52.18f, 21.24f, 84.18f),             //平行移動
	D3DXQUATERNION(0.00, 0.62f, 0.00f, -0.79f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-55.00f, 19.16f, 83.32f),             //平行移動
	D3DXQUATERNION(-0.43, 0.58f, -0.55f, -0.42f ),    //回転
	D3DXVECTOR3(0.15f, 0.62f, 0.24f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_jump0 (1)
{
	D3DXVECTOR3(-56.68f, 23.15f, 82.85f),             //平行移動
	D3DXQUATERNION(0.00, 0.62f, 0.00f, -0.79f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-62.44f, 26.09f, 80.22f),             //平行移動
	D3DXQUATERNION(-0.57, 0.26f, -0.76f, -0.17f ),    //回転
	D3DXVECTOR3(1.41f, 1.95f, 5.35f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor4 (1)
{
	D3DXVECTOR3(-44.51f, 18.13f, 83.54f),             //平行移動
	D3DXQUATERNION(0.10, 0.59f, -0.07f, 0.80f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 3.05f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor4 (2)
{
	D3DXVECTOR3(-45.71f, 18.12f, 87.42f),             //平行移動
	D3DXQUATERNION(0.10, 0.59f, -0.07f, 0.80f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 3.05f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (1)
{
	D3DXVECTOR3(-64.78f, 12.16f, -1.72f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (2)
{
	D3DXVECTOR3(-67.02f, 12.16f, 0.83f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (3)
{
	D3DXVECTOR3(-68.52f, 12.16f, 3.63f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (4)
{
	D3DXVECTOR3(-68.15f, 17.19f, 16.00f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (5)
{
	D3DXVECTOR3(-68.04f, 17.19f, 18.25f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (6)
{
	D3DXVECTOR3(-67.57f, 17.19f, 20.45f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (7)
{
	D3DXVECTOR3(-67.06f, 17.19f, 22.72f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (8)
{
	D3DXVECTOR3(-56.28f, 23.38f, 34.47f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (9)
{
	D3DXVECTOR3(-55.09f, 23.38f, 35.61f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (10)
{
	D3DXVECTOR3(-53.79f, 23.38f, 36.58f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (11)
{
	D3DXVECTOR3(-53.11f, 23.38f, 37.51f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (12)
{
	D3DXVECTOR3(-57.15f, 23.38f, 33.48f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (13)
{
	D3DXVECTOR3(-50.44f, 23.38f, 39.57f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (14)
{
	D3DXVECTOR3(-49.59f, 23.38f, 40.84f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (15)
{
	D3DXVECTOR3(-47.40f, 23.38f, 43.27f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (16)
{
	D3DXVECTOR3(-48.67f, 23.38f, 42.05f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (7)
{
	D3DXVECTOR3(-52.65f, 22.81f, 34.94f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (8)
{
	D3DXVECTOR3(-55.41f, 22.81f, 38.02f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (9)
{
	D3DXVECTOR3(-51.34f, 22.81f, 36.53f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (10)
{
	D3DXVECTOR3(-53.60f, 22.81f, 39.25f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (11)
{
	D3DXVECTOR3(-50.84f, 22.81f, 37.18f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (12)
{
	D3DXVECTOR3(-48.32f, 22.81f, 39.80f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (13)
{
	D3DXVECTOR3(-50.93f, 22.81f, 42.09f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (14)
{
	D3DXVECTOR3(-46.68f, 22.81f, 42.05f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (15)
{
	D3DXVECTOR3(-49.09f, 22.81f, 44.14f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (16)
{
	D3DXVECTOR3(-45.83f, 22.81f, 43.90f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (17)
{
	D3DXVECTOR3(-47.49f, 22.81f, 45.46f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet1 (1)
{
	D3DXVECTOR3(-50.15f, 22.73f, 45.91f),             //平行移動
	D3DXQUATERNION(0.37, -0.79f, -0.13f, -0.48f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet2 (1)
{
	D3DXVECTOR3(-42.90f, 23.33f, 44.51f),             //平行移動
	D3DXQUATERNION(0.60, 0.10f, -0.35f, -0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet3 (1)
{
	D3DXVECTOR3(-40.14f, 24.96f, 54.06f),             //平行移動
	D3DXQUATERNION(-0.36, 0.71f, -0.57f, 0.22f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet0 (1)
{
	D3DXVECTOR3(-47.53f, 22.06f, 38.50f),             //平行移動
	D3DXQUATERNION(-0.49, 0.33f, 0.81f, -0.05f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet5 (1)
{
	D3DXVECTOR3(-45.47f, 23.50f, 49.61f),             //平行移動
	D3DXQUATERNION(0.70, 0.59f, 0.38f, 0.12f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet4 (1)
{
	D3DXVECTOR3(-33.62f, 25.78f, 49.46f),             //平行移動
	D3DXQUATERNION(0.30, 0.50f, -0.63f, -0.51f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor8 (1)
{
	D3DXVECTOR3(-63.73f, 24.45f, 80.75f),             //平行移動
	D3DXQUATERNION(0.00, 0.61f, 0.00f, 0.79f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont(18)
{
	D3DXVECTOR3(-51.60f, 22.81f, 41.23f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (18)
{
	D3DXVECTOR3(-48.77f, 23.43f, 39.46f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (19)
{
	D3DXVECTOR3(-50.25f, 22.81f, 42.35f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (20)
{
	D3DXVECTOR3(-47.66f, 22.81f, 41.47f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (21)
{
	D3DXVECTOR3(-50.92f, 22.81f, 43.61f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (22)
{
	D3DXVECTOR3(-45.25f, 22.81f, 42.04f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (23)
{
	D3DXVECTOR3(-49.50f, 22.81f, 45.32f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (24)
{
	D3DXVECTOR3(-46.75f, 22.81f, 40.83f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball3
{
	D3DXVECTOR3(-35.23f, 29.93f, 52.90f),             //平行移動
	D3DXQUATERNION(-0.41, 0.49f, -0.75f, -0.19f ),    //回転
	D3DXVECTOR3(0.86f, 0.41f, 2.74f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball3
{
	D3DXVECTOR3(-13.14f, 23.68f, 68.61f),             //平行移動
	D3DXQUATERNION(-0.25, 0.23f, -0.93f, -0.12f ),    //回転
	D3DXVECTOR3(0.85f, 0.63f, 1.66f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (5)
{
	D3DXVECTOR3(-55.23f, 23.84f, 86.14f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (21)
{
	D3DXVECTOR3(-49.49f, 23.84f, 87.75f),             //平行移動
	D3DXQUATERNION(0.70, 0.10f, 0.10f, -0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (22)
{
	D3DXVECTOR3(-47.52f, 23.84f, 81.18f),             //平行移動
	D3DXQUATERNION(0.70, 0.10f, 0.10f, -0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (6)
{
	D3DXVECTOR3(-53.16f, 23.84f, 79.41f),             //平行移動
	D3DXQUATERNION(-0.70, -0.10f, -0.10f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-49.95f, 19.43f, 87.04f),             //平行移動
	D3DXQUATERNION(-0.69, 0.71f, -0.09f, 0.11f ),    //回転
	D3DXVECTOR3(0.30f, 0.62f, 0.11f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-48.55f, 19.16f, 82.25f),             //平行移動
	D3DXQUATERNION(0.11, 0.09f, -0.69f, -0.71f ),    //回転
	D3DXVECTOR3(0.30f, 0.62f, 0.12f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
