//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-9.70f, -0.80f, 7.70f),             //平行移動
	D3DXQUATERNION(-0.14f, 0.18f, 0.03f, 0.97f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,    //屈折率タイプ
	1.00f,      //透明度
},
//PoO_Table
{
	"PoO_Table.x",             //ファイル名
	D3DXVECTOR3(-1.10f, -15.00f, 0.80f),             //平行移動
	D3DXQUATERNION(1.00f, 0.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(20.00f, 20.00f, 20.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(0.00f, 0.00f, 0.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(13.40f, 0.00f, 10.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	3,    //屈折率タイプ
	0.50f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(0.38f, 0.17f, 20.00f),             //平行移動
	D3DXQUATERNION(-0.03f, -0.21f, -0.15f, 0.97f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	1,    //屈折率タイプ
	1.00f,      //透明度
},
