//Up
{
	D3DXVECTOR3(0.00f, 1.36f, -2.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(0.00f, 6.20f, 0.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-0.10f, 7.29f, 7.94f),             //平行移動
	D3DXQUATERNION(-0.47f, 0.50f, -0.50f, -0.53f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.06f, -1.00f, 0.05f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(12.70f, 6.09f, 48.10f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//UnMove (1)
{
	D3DXVECTOR3(16.20f, 6.09f, 51.80f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (2)
{
	D3DXVECTOR3(19.20f, 6.09f, 54.90f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall
{
	D3DXVECTOR3(0.00f, 5.60f, 8.38f),             //平行移動
	D3DXQUATERNION(-0.21f, 0.00f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(2.02f, 1.00f, 3.03f ),            //拡大
	D3DXVECTOR3(0.00f, 0.40f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	5.00f,//最大移動量
},
//UnMove (5)
{
	D3DXVECTOR3(0.00f, 2.30f, 13.90f),             //平行移動
	D3DXQUATERNION(0.09f, -0.02f, 0.18f, 0.98f ),    //回転
	D3DXVECTOR3(1.82f, 1.00f, 1.98f ),            //拡大
	D3DXVECTOR3(0.00f, -0.18f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (6)
{
	D3DXVECTOR3(10.00f, 9.00f, 51.70f),             //平行移動
	D3DXQUATERNION(-0.06f, -0.62f, 0.08f, 0.78f ),    //回転
	D3DXVECTOR3(2.28f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.97f, 0.00f, 0.23f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (7)
{
	D3DXVECTOR3(12.79f, 9.67f, 52.45f),             //平行移動
	D3DXQUATERNION(-0.10f, 0.03f, 0.02f, 0.99f ),    //回転
	D3DXVECTOR3(3.31f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.05f, 0.19f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(14.78f, 9.28f, 49.89f),             //平行移動
	D3DXQUATERNION(-0.67f, -0.11f, 0.16f, 0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.37f, 0.93f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(33.15f, 3.64f, 66.13f),             //平行移動
	D3DXQUATERNION(-0.67f, 0.11f, -0.13f, -0.72f ),    //回転
	D3DXVECTOR3(1.02f, 1.00f, 1.03f ),            //拡大
	D3DXVECTOR3(0.02f, -1.00f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall
{
	D3DXVECTOR3(86.60f, 12.92f, 92.72f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Boss (2)
{
	D3DXVECTOR3(73.00f, 15.20f, 67.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	4,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (3)
{
	D3DXVECTOR3(67.00f, 12.00f, 67.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(12.00f, 2.80f, 12.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (13)
{
	D3DXVECTOR3(63.92f, 14.96f, 70.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (14)
{
	D3DXVECTOR3(70.02f, 14.96f, 70.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (11)
{
	D3DXVECTOR3(63.92f, 14.96f, 64.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (12)
{
	D3DXVECTOR3(70.02f, 14.96f, 64.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet
{
	D3DXVECTOR3(63.92f, 16.07f, 70.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (1)
{
	D3DXVECTOR3(70.02f, 16.07f, 70.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (2)
{
	D3DXVECTOR3(63.92f, 16.07f, 64.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (3)
{
	D3DXVECTOR3(70.02f, 16.07f, 64.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(136.80f, 25.50f, 95.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	2.00f,//最大移動量
},
//UnMove (8)
{
	D3DXVECTOR3(136.80f, 25.50f, 103.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (9)
{
	D3DXVECTOR3(136.80f, 25.50f, 87.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Down
{
	D3DXVECTOR3(128.80f, 25.50f, 95.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	2.00f,//最大移動量
},
//UnMove (4)
{
	D3DXVECTOR3(180.20f, 45.20f, 72.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(14.00f, 2.80f, 14.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(120.50f, 11.86f, 95.10f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	14.00f,//最大移動量
},
//DivisionWall (3)
{
	D3DXVECTOR3(74.80f, 15.20f, 79.33f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (1)
{
	D3DXVECTOR3(114.70f, 12.92f, 92.72f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR
{
	D3DXVECTOR3(111.90f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB
{
	D3DXVECTOR3(111.90f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB
{
	D3DXVECTOR3(111.90f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (1)
{
	D3DXVECTOR3(110.00f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (2)
{
	D3DXVECTOR3(110.00f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (1)
{
	D3DXVECTOR3(110.00f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (2)
{
	D3DXVECTOR3(108.10f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (3)
{
	D3DXVECTOR3(108.10f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (4)
{
	D3DXVECTOR3(108.10f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (5)
{
	D3DXVECTOR3(102.30f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (6)
{
	D3DXVECTOR3(102.30f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (3)
{
	D3DXVECTOR3(102.30f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (4)
{
	D3DXVECTOR3(104.20f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (7)
{
	D3DXVECTOR3(104.20f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (8)
{
	D3DXVECTOR3(104.20f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (9)
{
	D3DXVECTOR3(106.10f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (10)
{
	D3DXVECTOR3(106.10f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (5)
{
	D3DXVECTOR3(106.10f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (6)
{
	D3DXVECTOR3(94.60f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (11)
{
	D3DXVECTOR3(94.60f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (12)
{
	D3DXVECTOR3(94.60f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (13)
{
	D3DXVECTOR3(92.60f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (14)
{
	D3DXVECTOR3(92.60f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (7)
{
	D3DXVECTOR3(92.60f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (8)
{
	D3DXVECTOR3(90.80f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (15)
{
	D3DXVECTOR3(90.80f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (16)
{
	D3DXVECTOR3(90.80f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (17)
{
	D3DXVECTOR3(96.60f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (18)
{
	D3DXVECTOR3(96.60f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (9)
{
	D3DXVECTOR3(96.60f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (10)
{
	D3DXVECTOR3(98.50f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (19)
{
	D3DXVECTOR3(98.50f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (20)
{
	D3DXVECTOR3(98.50f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (21)
{
	D3DXVECTOR3(100.40f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (22)
{
	D3DXVECTOR3(100.40f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (11)
{
	D3DXVECTOR3(100.40f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (23)
{
	D3DXVECTOR3(88.90f, 12.92f, 96.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (24)
{
	D3DXVECTOR3(88.90f, 12.92f, 93.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (12)
{
	D3DXVECTOR3(88.90f, 12.92f, 95.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//BGM_Changer
{
	D3DXVECTOR3(137.00f, 28.94f, 95.20f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(23.27f, 10.00f, 30.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	8,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (10)
{
	D3DXVECTOR3(169.80f, 17.50f, 66.50f),             //平行移動
	D3DXQUATERNION(0.06f, 0.16f, -0.02f, 0.98f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 11.70f ),            //拡大
	D3DXVECTOR3(0.32f, -0.11f, 0.94f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(165.00f, 17.26f, 72.10f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	15.00f,//最大移動量
},
//BGM_Changer (1)
{
	D3DXVECTOR3(180.10f, 45.40f, 72.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(23.27f, 10.00f, 22.13f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	8,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (4)
{
	D3DXVECTOR3(139.20f, 28.74f, 83.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
