//enemy_bullet0
{
	D3DXVECTOR3(-16.18f, 12.00f, -28.98f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0
{
	D3DXVECTOR3(-0.47f, 0.99f, -10.23f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball0
{
	D3DXVECTOR3(-35.51f, 12.13f, -31.01f),             //平行移動
	D3DXQUATERNION(0.12f, -0.38f, 0.05f, 0.92f ),    //回転
	D3DXVECTOR3(1.56f, 0.95f, 1.87f ),            //拡大
	D3DXVECTOR3(-0.68f, -0.26f, 0.68f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball2
{
	D3DXVECTOR3(-49.06f, 22.53f, 47.07f),             //平行移動
	D3DXQUATERNION(0.18f, 0.81f, -0.44f, 0.34f ),    //回転
	D3DXVECTOR3(1.01f, 1.14f, 0.89f ),            //拡大
	D3DXVECTOR3(0.39f, -0.84f, -0.39f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball1
{
	D3DXVECTOR3(-53.20f, 5.70f, -13.84f),             //平行移動
	D3DXQUATERNION(0.16f, 0.84f, -0.35f, 0.39f ),    //回転
	D3DXVECTOR3(1.03f, 1.60f, 1.60f ),            //拡大
	D3DXVECTOR3(0.54f, -0.71f, -0.45f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor0
{
	D3DXVECTOR3(-51.20f, 7.65f, -15.69f),             //平行移動
	D3DXQUATERNION(0.00f, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.71f, 0.00f, 0.71f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	2.00f,//最大移動量
},
//ChocoWall0
{
	D3DXVECTOR3(-12.79f, 16.86f, 65.03f),             //平行移動
	D3DXQUATERNION(0.04f, 0.38f, 0.01f, 0.93f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.70f, -0.06f, 0.71f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall1
{
	D3DXVECTOR3(-26.21f, 20.81f, 56.10f),             //平行移動
	D3DXQUATERNION(0.08f, 0.46f, -0.10f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.80f, -0.22f, 0.56f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball3
{
	D3DXVECTOR3(-23.97f, 27.37f, 61.02f),             //平行移動
	D3DXQUATERNION(-0.45f, 0.09f, -0.89f, 0.01f ),    //回転
	D3DXVECTOR3(0.86f, 0.80f, 0.72f ),            //拡大
	D3DXVECTOR3(0.80f, -0.16f, 0.58f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball4
{
	D3DXVECTOR3(-22.07f, 22.83f, 93.87f),             //平行移動
	D3DXQUATERNION(-0.94f, 0.02f, -0.35f, 0.01f ),    //回転
	D3DXVECTOR3(0.87f, 0.79f, 0.71f ),            //拡大
	D3DXVECTOR3(0.65f, 0.00f, -0.76f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball5
{
	D3DXVECTOR3(-30.58f, 21.45f, 85.25f),             //平行移動
	D3DXQUATERNION(-0.78f, 0.04f, -0.62f, -0.06f ),    //回転
	D3DXVECTOR3(0.85f, 0.80f, 0.74f ),            //拡大
	D3DXVECTOR3(0.96f, -0.14f, -0.23f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-43.13f, 19.95f, 83.64f),             //平行移動
	D3DXQUATERNION(0.09f, 0.09f, -0.70f, -0.70f ),    //回転
	D3DXVECTOR3(0.90f, 0.61f, 0.96f ),            //拡大
	D3DXVECTOR3(-0.26f, 0.01f, 0.97f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor4
{
	D3DXVECTOR3(-44.51f, 18.13f, 83.54f),             //平行移動
	D3DXQUATERNION(0.10f, 0.59f, -0.07f, 0.80f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 3.05f ),            //拡大
	D3DXVECTOR3(0.93f, -0.25f, 0.29f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor5
{
	D3DXVECTOR3(-45.71f, 18.12f, 87.42f),             //平行移動
	D3DXQUATERNION(0.10f, 0.59f, -0.07f, 0.80f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 3.05f ),            //拡大
	D3DXVECTOR3(0.93f, -0.25f, 0.29f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR1
{
	D3DXVECTOR3(-64.78f, 12.16f, -1.72f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR2
{
	D3DXVECTOR3(-67.02f, 12.16f, 0.83f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (3)
{
	D3DXVECTOR3(-68.52f, 12.16f, 3.63f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (4)
{
	D3DXVECTOR3(-68.15f, 17.55f, 16.00f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (5)
{
	D3DXVECTOR3(-68.04f, 17.55f, 18.25f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (6)
{
	D3DXVECTOR3(-67.57f, 17.55f, 20.45f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (7)
{
	D3DXVECTOR3(-67.06f, 17.55f, 22.72f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (8)
{
	D3DXVECTOR3(-56.28f, 23.38f, 34.47f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (9)
{
	D3DXVECTOR3(-55.09f, 23.38f, 35.61f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (10)
{
	D3DXVECTOR3(-53.79f, 23.38f, 36.58f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (11)
{
	D3DXVECTOR3(-53.11f, 23.38f, 37.51f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (12)
{
	D3DXVECTOR3(-57.15f, 23.38f, 33.48f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (13)
{
	D3DXVECTOR3(-50.44f, 23.38f, 39.57f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (14)
{
	D3DXVECTOR3(-49.59f, 23.38f, 40.84f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (15)
{
	D3DXVECTOR3(-47.40f, 23.38f, 43.27f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0 (16)
{
	D3DXVECTOR3(-48.67f, 23.38f, 42.05f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (7)
{
	D3DXVECTOR3(-52.65f, 22.81f, 34.94f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (8)
{
	D3DXVECTOR3(-55.41f, 22.81f, 38.02f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (9)
{
	D3DXVECTOR3(-51.34f, 22.81f, 36.53f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (10)
{
	D3DXVECTOR3(-53.60f, 22.81f, 39.25f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (11)
{
	D3DXVECTOR3(-50.84f, 22.81f, 37.18f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (12)
{
	D3DXVECTOR3(-48.32f, 22.81f, 39.80f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (13)
{
	D3DXVECTOR3(-50.93f, 22.81f, 42.09f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (14)
{
	D3DXVECTOR3(-46.68f, 22.81f, 42.05f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (15)
{
	D3DXVECTOR3(-49.09f, 22.81f, 44.14f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (16)
{
	D3DXVECTOR3(-45.83f, 22.81f, 43.90f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (17)
{
	D3DXVECTOR3(-47.49f, 22.81f, 45.46f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet1 (1)
{
	D3DXVECTOR3(-50.15f, 22.73f, 45.91f),             //平行移動
	D3DXQUATERNION(0.37f, -0.79f, -0.13f, -0.48f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.65f, 0.56f, -0.51f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet2 (1)
{
	D3DXVECTOR3(-42.90f, 23.33f, 44.51f),             //平行移動
	D3DXQUATERNION(0.60f, 0.10f, -0.35f, -0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.56f, 0.79f, 0.27f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet3 (1)
{
	D3DXVECTOR3(-40.14f, 24.96f, 54.06f),             //平行移動
	D3DXQUATERNION(-0.36f, 0.71f, -0.57f, 0.22f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.72f, -0.65f, -0.26f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet0 (1)
{
	D3DXVECTOR3(-47.53f, 22.06f, 38.50f),             //平行移動
	D3DXQUATERNION(-0.49f, 0.33f, 0.81f, -0.05f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.82f, 0.48f, 0.31f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet5 (1)
{
	D3DXVECTOR3(-45.47f, 23.50f, 49.61f),             //平行移動
	D3DXQUATERNION(0.70f, 0.59f, 0.38f, 0.12f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.67f, 0.27f, -0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet4 (1)
{
	D3DXVECTOR3(-33.62f, 25.78f, 49.46f),             //平行移動
	D3DXQUATERNION(0.30f, 0.50f, -0.63f, -0.51f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.89f, -0.32f, 0.31f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (17)
{
	D3DXVECTOR3(-51.60f, 22.81f, 41.23f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (18)
{
	D3DXVECTOR3(-48.77f, 23.43f, 39.46f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (19)
{
	D3DXVECTOR3(-50.25f, 22.81f, 42.35f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (20)
{
	D3DXVECTOR3(-47.66f, 22.81f, 41.47f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (21)
{
	D3DXVECTOR3(-50.92f, 22.81f, 43.61f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (22)
{
	D3DXVECTOR3(-45.25f, 22.81f, 42.04f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (23)
{
	D3DXVECTOR3(-49.50f, 22.81f, 45.32f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_Flont (24)
{
	D3DXVECTOR3(-46.75f, 22.81f, 40.83f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	D3DXVECTOR3(-0.01f, 0.00f, -1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball7
{
	D3DXVECTOR3(-35.23f, 29.93f, 52.90f),             //平行移動
	D3DXQUATERNION(-0.41f, 0.49f, -0.75f, -0.19f ),    //回転
	D3DXVECTOR3(0.86f, 0.41f, 2.74f ),            //拡大
	D3DXVECTOR3(0.42f, -0.88f, 0.20f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball8
{
	D3DXVECTOR3(-13.14f, 23.68f, 68.61f),             //平行移動
	D3DXQUATERNION(-0.25f, 0.23f, -0.93f, -0.12f ),    //回転
	D3DXVECTOR3(0.85f, 0.63f, 1.66f ),            //拡大
	D3DXVECTOR3(0.41f, -0.48f, 0.77f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball9
{
	D3DXVECTOR3(-59.91f, 22.17f, 98.98f),             //平行移動
	D3DXQUATERNION(0.82f, -0.11f, 0.18f, 0.52f ),    //回転
	D3DXVECTOR3(0.70f, 4.00f, 1.57f ),            //拡大
	D3DXVECTOR3(0.18f, -0.90f, -0.38f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor0 (2)
{
	D3DXVECTOR3(-59.54f, 12.67f, 97.99f),             //平行移動
	D3DXQUATERNION(0.00f, -0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 7.84f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball10
{
	D3DXVECTOR3(-18.05f, 38.48f, 6.74f),             //平行移動
	D3DXQUATERNION(-0.66f, -0.29f, 0.11f, -0.69f ),    //回転
	D3DXVECTOR3(0.66f, 0.67f, 0.84f ),            //拡大
	D3DXVECTOR3(0.25f, -0.97f, -0.03f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet1
{
	D3DXVECTOR3(-8.53f, 25.63f, -2.56f),             //平行移動
	D3DXQUATERNION(0.32f, -0.29f, -0.09f, -0.90f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.47f, 0.63f, 0.62f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor1
{
	D3DXVECTOR3(-62.02f, 32.73f, 67.86f),             //平行移動
	D3DXQUATERNION(-0.03f, 0.93f, -0.02f, 0.38f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.70f, -0.01f, -0.72f),             //Zの向きベクトル
	999,//エネミータイプ
	3,//ギミックタイプ
	7.50f,//最大移動量
},
//UpFloor3
{
	D3DXVECTOR3(-64.42f, 3.44f, 71.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	30.00f,//最大移動量
},
//FireJet2
{
	D3DXVECTOR3(-39.89f, 34.42f, 47.17f),             //平行移動
	D3DXQUATERNION(0.63f, 0.66f, -0.17f, -0.37f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.70f, 0.24f, -0.67f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall2
{
	D3DXVECTOR3(-72.75f, 20.79f, 101.77f),             //平行移動
	D3DXQUATERNION(0.05f, 0.40f, 0.00f, -0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 0.93f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.09f, 0.68f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet3
{
	D3DXVECTOR3(-49.95f, 37.61f, 51.82f),             //平行移動
	D3DXQUATERNION(0.06f, 0.57f, -0.60f, 0.55f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.56f, -0.75f, 0.34f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor7
{
	D3DXVECTOR3(7.50f, 33.50f, -8.66f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//UpFloor0 (4)
{
	D3DXVECTOR3(-60.90f, 16.18f, 97.35f),             //平行移動
	D3DXQUATERNION(-0.08f, -0.18f, 0.39f, 0.90f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 7.84f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor2
{
	D3DXVECTOR3(-78.50f, 19.09f, 92.81f),             //平行移動
	D3DXQUATERNION(0.00f, 0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	3.50f,//最大移動量
},
//gimmick_Chocoball11
{
	D3DXVECTOR3(-59.91f, 22.17f, 98.98f),             //平行移動
	D3DXQUATERNION(0.53f, -0.18f, 0.12f, 0.82f ),    //回転
	D3DXVECTOR3(0.70f, 4.16f, 1.59f ),            //拡大
	D3DXVECTOR3(-0.16f, -0.92f, 0.37f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor6
{
	D3DXVECTOR3(5.87f, 23.16f, -6.11f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//UpFloor0
{
	D3DXVECTOR3(-55.05f, 16.55f, 87.37f),             //平行移動
	D3DXQUATERNION(0.00f, -0.21f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.41f, 0.00f, 0.91f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor3
{
	D3DXVECTOR3(-16.51f, 35.87f, 7.22f),             //平行移動
	D3DXQUATERNION(0.03f, -0.23f, 0.03f, 0.97f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(-0.44f, -0.07f, 0.89f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	10.00f,//最大移動量
},
//ChocoWall4
{
	D3DXVECTOR3(-81.41f, 20.25f, 97.18f),             //平行移動
	D3DXQUATERNION(0.03f, 0.97f, -0.04f, -0.23f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.45f, -0.06f, -0.89f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor0 (6)
{
	D3DXVECTOR3(-65.47f, 20.35f, 103.50f),             //平行移動
	D3DXQUATERNION(0.00f, -0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball12
{
	D3DXVECTOR3(-59.91f, 22.17f, 98.98f),             //平行移動
	D3DXQUATERNION(0.70f, -0.15f, 0.16f, 0.68f ),    //回転
	D3DXVECTOR3(0.70f, 0.71f, 0.85f ),            //拡大
	D3DXVECTOR3(0.02f, -1.00f, -0.02f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor0 (1)
{
	D3DXVECTOR3(-56.20f, 16.75f, 90.09f),             //平行移動
	D3DXQUATERNION(0.00f, -0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	4.00f,//最大移動量
},
//MoveFloor2
{
	D3DXVECTOR3(-53.18f, 18.39f, 85.94f),             //平行移動
	D3DXQUATERNION(0.00f, 0.79f, 0.00f, 0.62f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.97f, 0.00f, -0.24f),             //Zの向きベクトル
	999,//エネミータイプ
	3,//ギミックタイプ
	5.00f,//最大移動量
},
//FireJet0
{
	D3DXVECTOR3(-5.37f, 26.29f, 0.82f),             //平行移動
	D3DXQUATERNION(-0.88f, 0.08f, 0.43f, 0.20f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.72f, 0.42f, -0.56f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor0 (3)
{
	D3DXVECTOR3(-62.65f, 12.54f, 105.40f),             //平行移動
	D3DXQUATERNION(0.00f, -0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	7.00f,//最大移動量
},
//ChocoWall3
{
	D3DXVECTOR3(-78.63f, 20.52f, 97.08f),             //平行移動
	D3DXQUATERNION(0.03f, 0.97f, -0.04f, -0.23f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.45f, -0.06f, -0.89f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor0 (5)
{
	D3DXVECTOR3(-58.15f, 16.25f, 98.56f),             //平行移動
	D3DXQUATERNION(0.07f, -0.19f, -0.37f, 0.91f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 7.84f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor4
{
	D3DXVECTOR3(-77.30f, 15.31f, 90.82f),             //平行移動
	D3DXQUATERNION(0.01f, -0.97f, -0.02f, -0.26f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.49f, 0.04f, -0.87f),             //Zの向きベクトル
	999,//エネミータイプ
	3,//ギミックタイプ
	14.00f,//最大移動量
},
//UpFloor0 (7)
{
	D3DXVECTOR3(-68.98f, 21.56f, 103.97f),             //平行移動
	D3DXQUATERNION(0.00f, -0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	2.00f,//最大移動量
},
//FireJet5
{
	D3DXVECTOR3(-44.35f, 32.67f, 47.64f),             //平行移動
	D3DXQUATERNION(0.15f, 0.66f, 0.67f, 0.30f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.61f, 0.79f, 0.09f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall5
{
	D3DXVECTOR3(-73.44f, 20.89f, 102.49f),             //平行移動
	D3DXQUATERNION(0.05f, 0.40f, 0.00f, -0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.09f, 0.68f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor0 (8)
{
	D3DXVECTOR3(-59.52f, 16.65f, 97.97f),             //平行移動
	D3DXQUATERNION(0.00f, -0.20f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 7.84f ),            //拡大
	D3DXVECTOR3(-0.39f, 0.00f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet4
{
	D3DXVECTOR3(-45.69f, 38.05f, 56.34f),             //平行移動
	D3DXQUATERNION(0.43f, 0.76f, -0.49f, 0.10f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.26f, -0.82f, -0.51f),             //Zの向きベクトル
	999,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor0 (1)
{
	D3DXVECTOR3(-31.00f, 30.44f, 34.51f),             //平行移動
	D3DXQUATERNION(0.00f, 0.90f, -0.02f, -0.44f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(-0.79f, -0.03f, -0.61f),             //Zの向きベクトル
	999,//エネミータイプ
	3,//ギミックタイプ
	8.50f,//最大移動量
},
//ChocoWall6 (23)
{
	D3DXVECTOR3(-24.90f, 32.74f, 24.31f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_jump0 (2)
{
	D3DXVECTOR3(-30.00f, 36.83f, 26.71f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, -0.01f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.02f, 0.01f, -1.00f),             //Zの向きベクトル
	2,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (24)
{
	D3DXVECTOR3(-25.30f, 32.74f, 25.21f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (25)
{
	D3DXVECTOR3(-30.40f, 37.84f, 35.91f),             //平行移動
	D3DXQUATERNION(0.36f, 0.61f, 0.61f, -0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (26)
{
	D3DXVECTOR3(-23.00f, 37.64f, 20.91f),             //平行移動
	D3DXQUATERNION(-0.68f, -0.18f, -0.18f, 0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (7)
{
	D3DXVECTOR3(-27.50f, 37.84f, 30.91f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (27)
{
	D3DXVECTOR3(-30.30f, 27.74f, 35.91f),             //平行移動
	D3DXQUATERNION(0.36f, 0.61f, 0.61f, -0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (28)
{
	D3DXVECTOR3(-22.90f, 32.64f, 20.91f),             //平行移動
	D3DXQUATERNION(-0.68f, -0.18f, -0.18f, 0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball13
{
	D3DXVECTOR3(-30.87f, 33.57f, 28.28f),             //平行移動
	D3DXQUATERNION(0.17f, 0.69f, -0.68f, 0.19f ),    //回転
	D3DXVECTOR3(0.15f, 0.62f, 0.24f ),            //拡大
	D3DXVECTOR3(0.04f, -1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (8)
{
	D3DXVECTOR3(-33.50f, 27.74f, 27.31f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_jump0 (3)
{
	D3DXVECTOR3(-32.40f, 34.93f, 30.81f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, -0.01f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.02f, 0.01f, -1.00f),             //Zの向きベクトル
	2,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall12 (1)
{
	D3DXVECTOR3(-29.90f, 27.84f, 32.81f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor8 (1)
{
	D3DXVECTOR3(-27.50f, 38.44f, 22.41f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.01f, -0.01f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (9)
{
	D3DXVECTOR3(-33.50f, 37.84f, 27.31f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball14
{
	D3DXVECTOR3(-26.08f, 40.04f, 21.65f),             //平行移動
	D3DXQUATERNION(0.24f, 0.30f, -0.92f, 0.10f ),    //回転
	D3DXVECTOR3(1.41f, 1.95f, 5.35f ),            //拡大
	D3DXVECTOR3(-0.38f, -0.60f, 0.71f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall14 (1)
{
	D3DXVECTOR3(-28.80f, 27.84f, 31.21f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (29)
{
	D3DXVECTOR3(-24.50f, 37.64f, 25.71f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (30)
{
	D3DXVECTOR3(-27.30f, 27.84f, 28.61f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (31)
{
	D3DXVECTOR3(-26.80f, 27.84f, 27.91f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (32)
{
	D3DXVECTOR3(-30.60f, 37.64f, 22.21f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (10)
{
	D3DXVECTOR3(-33.50f, 32.74f, 27.31f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (33)
{
	D3DXVECTOR3(-36.40f, 27.84f, 32.41f),             //平行移動
	D3DXQUATERNION(0.36f, 0.61f, 0.61f, -0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (34)
{
	D3DXVECTOR3(-26.40f, 27.94f, 26.91f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (35)
{
	D3DXVECTOR3(-36.30f, 32.84f, 32.61f),             //平行移動
	D3DXQUATERNION(0.36f, 0.61f, 0.61f, -0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall9 (1)
{
	D3DXVECTOR3(-23.40f, 32.74f, 21.91f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (36)
{
	D3DXVECTOR3(-25.40f, 37.64f, 25.11f),             //平行移動
	D3DXQUATERNION(-0.68f, -0.18f, -0.18f, 0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (37)
{
	D3DXVECTOR3(-31.30f, 27.84f, 35.51f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall8 (1)
{
	D3DXVECTOR3(-25.80f, 27.94f, 26.11f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (38)
{
	D3DXVECTOR3(-23.90f, 32.74f, 22.61f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (39)
{
	D3DXVECTOR3(-27.80f, 27.84f, 29.51f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (40)
{
	D3DXVECTOR3(-30.40f, 32.74f, 35.91f),             //平行移動
	D3DXQUATERNION(0.36f, 0.61f, 0.61f, -0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (41)
{
	D3DXVECTOR3(-31.20f, 32.74f, 35.51f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (11)
{
	D3DXVECTOR3(-27.50f, 32.74f, 30.91f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (42)
{
	D3DXVECTOR3(-24.40f, 32.64f, 23.51f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor8 (2)
{
	D3DXVECTOR3(-26.30f, 38.44f, 20.31f),             //平行移動
	D3DXQUATERNION(0.00f, -0.24f, 0.00f, 0.97f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(-0.47f, -0.01f, 0.88f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (43)
{
	D3DXVECTOR3(-24.50f, 32.64f, 25.61f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall13 (1)
{
	D3DXVECTOR3(-29.10f, 27.84f, 32.21f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (12)
{
	D3DXVECTOR3(-27.50f, 27.74f, 30.91f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (44)
{
	D3DXVECTOR3(-36.30f, 37.94f, 32.61f),             //平行移動
	D3DXQUATERNION(0.36f, 0.61f, 0.61f, -0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall6 (45)
{
	D3DXVECTOR3(-30.70f, 32.64f, 22.31f),             //平行移動
	D3DXQUATERNION(-0.36f, -0.61f, -0.61f, 0.35f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall10 (1)
{
	D3DXVECTOR3(-30.70f, 27.84f, 34.61f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall7 (13)
{
	D3DXVECTOR3(-28.20f, 27.84f, 30.31f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR1 (2)
{
	D3DXVECTOR3(-33.50f, 33.77f, 32.82f),             //平行移動
	D3DXQUATERNION(0.00f, 0.50f, 0.00f, -0.87f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.87f, 0.00f, 0.50f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor4 (3)
{
	D3DXVECTOR3(-32.30f, 34.14f, 30.91f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.01f, -0.01f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall11 (1)
{
	D3DXVECTOR3(-30.10f, 27.84f, 33.71f),             //平行移動
	D3DXQUATERNION(0.68f, 0.18f, 0.18f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor5 (1)
{
	D3DXVECTOR3(-29.90f, 36.04f, 26.71f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.50f ),            //拡大
	D3DXVECTOR3(0.01f, -0.01f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball15
{
	D3DXVECTOR3(-31.25f, 33.37f, 34.70f),             //平行移動
	D3DXQUATERNION(0.61f, 0.61f, -0.34f, -0.37f ),    //回転
	D3DXVECTOR3(0.30f, 0.62f, 0.12f ),            //拡大
	D3DXVECTOR3(-0.87f, 0.04f, -0.49f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball16
{
	D3DXVECTOR3(-35.63f, 33.44f, 32.24f),             //平行移動
	D3DXQUATERNION(0.61f, 0.61f, -0.34f, -0.37f ),    //回転
	D3DXVECTOR3(0.30f, 0.62f, 0.12f ),            //拡大
	D3DXVECTOR3(-0.87f, 0.04f, -0.49f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
