//gimmick_Chocoball
{
	D3DXVECTOR3(-9.59f, 19.05f, 0.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(0.00f, 15.36f, 0.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (1)
{
	D3DXVECTOR3(-2.84f, 17.08f, -14.30f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (2)
{
	D3DXVECTOR3(-5.66f, 17.08f, -18.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (3)
{
	D3DXVECTOR3(-7.57f, 17.08f, -22.23f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (4)
{
	D3DXVECTOR3(-11.76f, 17.08f, -23.26f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (5)
{
	D3DXVECTOR3(-12.86f, 17.08f, -26.62f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball
{
	D3DXVECTOR3(-34.52f, 20.55f, -27.26f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(5.23f, 1.00f, 0.12f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball
{
	D3DXVECTOR3(-43.75f, 21.88f, -28.08f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, -0.71f ),    //回転
	D3DXVECTOR3(4.14f, 1.00f, 0.12f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball
{
	D3DXVECTOR3(-62.92f, 16.38f, -26.85f),             //平行移動
	D3DXQUATERNION(0.00, -0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(4.84f, 1.00f, 0.12f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (6)
{
	D3DXVECTOR3(-86.20f, 5.80f, -8.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (7)
{
	D3DXVECTOR3(-93.10f, 5.80f, -8.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 (8)
{
	D3DXVECTOR3(-97.60f, 5.80f, -8.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
