//Boss
{
	D3DXVECTOR3(-151.41f, 6.73f, -68.01f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	4,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(-151.40f, -0.69f, -79.70f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(-151.40f, 4.11f, -77.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-151.50f, 7.30f, -68.10f),             //平行移動
	D3DXQUATERNION(-0.47f, 0.50f, -0.50f, -0.53f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.06f, -1.00f, 0.05f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(-138.70f, 6.90f, -2.40f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall
{
	D3DXVECTOR3(-151.40f, 4.00f, -33.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (1)
{
	D3DXVECTOR3(-135.20f, 6.90f, 1.30f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (2)
{
	D3DXVECTOR3(-132.20f, 6.90f, 4.40f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall
{
	D3DXVECTOR3(-151.40f, 3.51f, -71.21f),             //平行移動
	D3DXQUATERNION(-0.21f, 0.00f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(2.02f, 1.00f, 3.03f ),            //拡大
	D3DXVECTOR3(0.00f, 0.40f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	5.00f,//最大移動量
},
//Down
{
	D3DXVECTOR3(-151.40f, 0.21f, -63.90f),             //平行移動
	D3DXQUATERNION(0.09f, -0.02f, 0.18f, 0.98f ),    //回転
	D3DXVECTOR3(1.82f, 1.00f, 1.98f ),            //拡大
	D3DXVECTOR3(0.00f, -0.18f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	-1.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-136.77f, 13.56f, -0.37f),             //平行移動
	D3DXQUATERNION(0.65f, -0.27f, 0.26f, 0.66f ),    //回転
	D3DXVECTOR3(0.48f, 3.94f, 1.22f ),            //拡大
	D3DXVECTOR3(-0.01f, -1.00f, 0.01f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (1)
{
	D3DXVECTOR3(-129.90f, 10.40f, 5.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.71f, 0.00f, 0.71f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (7)
{
	D3DXVECTOR3(-114.58f, 6.42f, 15.15f),             //平行移動
	D3DXQUATERNION(0.52f, -0.52f, -0.48f, 0.48f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-1.00f, 0.00f, -0.07f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (5)
{
	D3DXVECTOR3(-75.82f, 25.47f, 4.82f),             //平行移動
	D3DXQUATERNION(0.64f, 0.28f, 0.68f, 0.23f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.08f, 0.02f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (6)
{
	D3DXVECTOR3(-74.73f, 25.52f, 4.88f),             //平行移動
	D3DXQUATERNION(-0.70f, 0.00f, -0.72f, 0.04f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.04f, 0.03f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-118.21f, 8.05f, 16.14f),             //平行移動
	D3DXQUATERNION(-0.67f, 0.11f, -0.13f, -0.72f ),    //回転
	D3DXVECTOR3(2.04f, 1.97f, 1.08f ),            //拡大
	D3DXVECTOR3(0.02f, -1.00f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall
{
	D3DXVECTOR3(-21.40f, 34.92f, 32.72f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (3)
{
	D3DXVECTOR3(-41.00f, 34.00f, 7.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(12.00f, 2.80f, 12.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (13)
{
	D3DXVECTOR3(-44.08f, 36.36f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (14)
{
	D3DXVECTOR3(-37.98f, 36.36f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (11)
{
	D3DXVECTOR3(-44.08f, 36.36f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (12)
{
	D3DXVECTOR3(-37.98f, 36.36f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet
{
	D3DXVECTOR3(-44.08f, 37.37f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (1)
{
	D3DXVECTOR3(-37.98f, 37.37f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (2)
{
	D3DXVECTOR3(-44.08f, 37.37f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (3)
{
	D3DXVECTOR3(-37.98f, 37.37f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(28.80f, 47.50f, 35.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	2.00f,//最大移動量
},
//UnMove (8)
{
	D3DXVECTOR3(28.80f, 47.50f, 43.04f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (9)
{
	D3DXVECTOR3(28.80f, 47.50f, 27.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Down
{
	D3DXVECTOR3(20.80f, 47.50f, 35.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	2.00f,//最大移動量
},
//UnMove (4)
{
	D3DXVECTOR3(76.20f, 67.20f, 11.00f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(14.00f, 2.80f, 14.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(12.50f, 33.86f, 35.10f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	14.00f,//最大移動量
},
//DivisionWall (3)
{
	D3DXVECTOR3(-33.20f, 37.20f, 19.33f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (1)
{
	D3DXVECTOR3(6.70f, 34.92f, 32.72f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR
{
	D3DXVECTOR3(3.90f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB
{
	D3DXVECTOR3(3.90f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB
{
	D3DXVECTOR3(3.90f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (1)
{
	D3DXVECTOR3(2.00f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (2)
{
	D3DXVECTOR3(2.00f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (1)
{
	D3DXVECTOR3(2.00f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (2)
{
	D3DXVECTOR3(0.10f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (3)
{
	D3DXVECTOR3(0.10f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (4)
{
	D3DXVECTOR3(0.10f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (5)
{
	D3DXVECTOR3(-5.70f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (6)
{
	D3DXVECTOR3(-5.70f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (3)
{
	D3DXVECTOR3(-5.70f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (4)
{
	D3DXVECTOR3(-3.80f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (7)
{
	D3DXVECTOR3(-3.80f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (8)
{
	D3DXVECTOR3(-3.80f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (9)
{
	D3DXVECTOR3(-1.90f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (10)
{
	D3DXVECTOR3(-1.90f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (5)
{
	D3DXVECTOR3(-1.90f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (6)
{
	D3DXVECTOR3(-13.40f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (11)
{
	D3DXVECTOR3(-13.40f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (12)
{
	D3DXVECTOR3(-13.40f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (13)
{
	D3DXVECTOR3(-15.40f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (14)
{
	D3DXVECTOR3(-15.40f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (7)
{
	D3DXVECTOR3(-15.40f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (8)
{
	D3DXVECTOR3(-17.20f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (15)
{
	D3DXVECTOR3(-17.20f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (16)
{
	D3DXVECTOR3(-17.20f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (17)
{
	D3DXVECTOR3(-11.40f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (18)
{
	D3DXVECTOR3(-11.40f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (9)
{
	D3DXVECTOR3(-11.40f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (10)
{
	D3DXVECTOR3(-9.50f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (19)
{
	D3DXVECTOR3(-9.50f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (20)
{
	D3DXVECTOR3(-9.50f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (21)
{
	D3DXVECTOR3(-7.60f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (22)
{
	D3DXVECTOR3(-7.60f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (11)
{
	D3DXVECTOR3(-7.60f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (23)
{
	D3DXVECTOR3(-19.10f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (24)
{
	D3DXVECTOR3(-19.10f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (12)
{
	D3DXVECTOR3(-19.10f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//BGM_Changer
{
	D3DXVECTOR3(-41.00f, 36.75f, 7.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(19.11f, 1.45f, 18.46f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	8,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(59.80f, 42.80f, 1.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.49f, 0.00f, 0.87f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.86f, 0.00f, 0.52f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	30.00f,//最大移動量
},
//BGM_Changer (1)
{
	D3DXVECTOR3(76.60f, 68.30f, 11.20f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(23.27f, 2.36f, 22.13f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	8,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (4)
{
	D3DXVECTOR3(29.40f, 46.87f, 12.08f),             //平行移動
	D3DXQUATERNION(0.50f, -0.50f, -0.49f, -0.51f ),    //回転
	D3DXVECTOR3(1.50f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.03f, 1.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (2)
{
	D3DXVECTOR3(86.40f, 70.74f, 3.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (3)
{
	D3DXVECTOR3(92.30f, 70.74f, 7.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (5)
{
	D3DXVECTOR3(88.80f, 70.74f, 11.30f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (6)
{
	D3DXVECTOR3(91.50f, 70.74f, 7.10f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (18)
{
	D3DXVECTOR3(87.60f, 70.02f, 7.90f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (7)
{
	D3DXVECTOR3(-153.80f, 1.60f, -22.10f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Down
{
	D3DXVECTOR3(-101.19f, 9.20f, 16.74f),             //平行移動
	D3DXQUATERNION(0.00f, 0.18f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.35f, 0.00f, 0.94f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	-1.00f,//最大移動量
},
//UnMove (19)
{
	D3DXVECTOR3(79.10f, 70.02f, 21.60f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (9)
{
	D3DXVECTOR3(82.80f, 70.74f, 21.30f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (10)
{
	D3DXVECTOR3(80.10f, 70.74f, 25.50f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (11)
{
	D3DXVECTOR3(83.60f, 70.74f, 21.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (12)
{
	D3DXVECTOR3(77.70f, 70.74f, 18.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (13)
{
	D3DXVECTOR3(71.00f, 70.74f, 11.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (14)
{
	D3DXVECTOR3(76.90f, 70.74f, 15.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (15)
{
	D3DXVECTOR3(73.40f, 70.74f, 18.90f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (16)
{
	D3DXVECTOR3(76.10f, 70.74f, 14.70f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (20)
{
	D3DXVECTOR3(72.40f, 70.02f, 15.10f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (21)
{
	D3DXVECTOR3(78.30f, 70.02f, 5.60f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (17)
{
	D3DXVECTOR3(82.20f, 70.74f, 4.80f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (18)
{
	D3DXVECTOR3(79.40f, 70.74f, 9.00f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (19)
{
	D3DXVECTOR3(83.00f, 70.74f, 5.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (20)
{
	D3DXVECTOR3(77.10f, 70.74f, 1.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(78.41f, 72.53f, 5.47f),             //平行移動
	D3DXQUATERNION(-0.17f, -0.30f, -0.27f, -0.90f ),    //回転
	D3DXVECTOR3(13.14f, 1.56f, 0.24f ),            //拡大
	D3DXVECTOR3(0.64f, -0.14f, 0.76f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(72.37f, 72.66f, 15.45f),             //平行移動
	D3DXQUATERNION(0.10f, 0.63f, -0.21f, 0.74f ),    //回転
	D3DXVECTOR3(13.64f, 1.33f, 0.37f ),            //拡大
	D3DXVECTOR3(0.89f, -0.41f, 0.18f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(79.23f, 72.41f, 21.68f),             //平行移動
	D3DXQUATERNION(-0.02f, 0.98f, -0.18f, -0.11f ),    //回転
	D3DXVECTOR3(8.35f, 1.35f, 0.80f ),            //拡大
	D3DXVECTOR3(-0.20f, -0.36f, -0.91f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(87.59f, 72.41f, 7.88f),             //平行移動
	D3DXQUATERNION(0.24f, -0.50f, -0.05f, 0.83f ),    //回転
	D3DXVECTOR3(5.08f, 1.49f, 0.97f ),            //拡大
	D3DXVECTOR3(-0.86f, -0.35f, 0.38f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(94.25f, 76.21f, 19.40f),             //平行移動
	D3DXQUATERNION(0.41f, -0.45f, -0.12f, 0.79f ),    //回転
	D3DXVECTOR3(6.58f, 0.19f, 0.37f ),            //拡大
	D3DXVECTOR3(-0.80f, -0.54f, 0.27f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(92.47f, 74.58f, 24.71f),             //平行移動
	D3DXQUATERNION(-0.66f, 0.72f, -0.09f, -0.20f ),    //回転
	D3DXVECTOR3(3.36f, 0.26f, 0.42f ),            //拡大
	D3DXVECTOR3(-0.17f, -0.39f, -0.91f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Up (1)
{
	D3DXVECTOR3(-57.40f, 27.23f, 5.99f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(3.00f, 1.00f, 3.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	8.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-94.72f, 28.47f, -21.19f),             //平行移動
	D3DXQUATERNION(-0.45f, -0.58f, 0.52f, -0.45f ),    //回転
	D3DXVECTOR3(1.02f, 1.00f, 1.03f ),            //拡大
	D3DXVECTOR3(0.05f, -1.00f, -0.06f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-81.48f, 24.85f, -6.69f),             //平行移動
	D3DXQUATERNION(-0.65f, -0.28f, 0.23f, -0.67f ),    //回転
	D3DXVECTOR3(1.02f, 0.76f, 1.02f ),            //拡大
	D3DXVECTOR3(0.08f, -1.00f, 0.01f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-74.60f, 27.97f, -14.28f),             //平行移動
	D3DXQUATERNION(-0.68f, -0.51f, 0.05f, -0.53f ),    //回転
	D3DXVECTOR3(24.03f, 0.53f, 2.40f ),            //拡大
	D3DXVECTOR3(0.47f, -0.76f, -0.44f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-145.05f, 6.74f, -8.44f),             //平行移動
	D3DXQUATERNION(-0.44f, -0.73f, 0.52f, -0.04f ),    //回転
	D3DXVECTOR3(12.73f, 0.63f, 1.72f ),            //拡大
	D3DXVECTOR3(-0.40f, -0.79f, -0.46f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMovw
{
	D3DXVECTOR3(-151.40f, -0.69f, -47.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 15.31f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	-1.00f,//最大移動量
},
//Wall (21)
{
	D3DXVECTOR3(-153.80f, 0.50f, -48.10f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (22)
{
	D3DXVECTOR3(-153.80f, 0.50f, -55.37f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (23)
{
	D3DXVECTOR3(-153.80f, 0.50f, -40.85f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (24)
{
	D3DXVECTOR3(-153.80f, 0.50f, -38.90f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (25)
{
	D3DXVECTOR3(-153.80f, 0.50f, -36.80f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (26)
{
	D3DXVECTOR3(-153.80f, 0.50f, -34.40f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, -1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (8)
{
	D3DXVECTOR3(-152.57f, 1.60f, -14.61f),             //平行移動
	D3DXQUATERNION(0.00f, 0.97f, 0.00f, -0.23f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.45f, 0.00f, -0.89f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall (1)
{
	D3DXVECTOR3(-118.74f, 6.16f, 15.46f),             //平行移動
	D3DXQUATERNION(0.00f, -0.18f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(-0.36f, 0.00f, 0.93f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	5.00f,//最大移動量
},
