//Boss
{
	D3DXVECTOR3(-151.40f, 3.40f, -43.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	4,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(-151.40f, 2.20f, -52.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(-151.40f, 7.00f, -50.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-151.50f, 8.09f, -42.62f),             //平行移動
	D3DXQUATERNION(-0.47f, 0.50f, -0.50f, -0.53f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.06f, -1.00f, 0.05f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(-138.70f, 6.90f, -2.40f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//DivisionWall
{
	D3DXVECTOR3(-151.40f, 4.00f, -33.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (1)
{
	D3DXVECTOR3(-135.20f, 6.90f, 1.30f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (2)
{
	D3DXVECTOR3(-132.20f, 6.90f, 4.40f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall
{
	D3DXVECTOR3(-151.40f, 6.40f, -42.20f),             //平行移動
	D3DXQUATERNION(-0.21f, 0.00f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(2.02f, 1.00f, 3.03f ),            //拡大
	D3DXVECTOR3(0.00f, 0.40f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	5.00f,//最大移動量
},
//UnMove (5)
{
	D3DXVECTOR3(-151.40f, 3.10f, -36.60f),             //平行移動
	D3DXQUATERNION(0.09f, -0.02f, 0.18f, 0.98f ),    //回転
	D3DXVECTOR3(1.82f, 1.00f, 1.98f ),            //拡大
	D3DXVECTOR3(0.00f, -0.18f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (6)
{
	D3DXVECTOR3(-141.40f, 9.80f, 1.20f),             //平行移動
	D3DXQUATERNION(-0.06f, -0.62f, 0.08f, 0.78f ),    //回転
	D3DXVECTOR3(2.28f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.97f, 0.00f, 0.23f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (7)
{
	D3DXVECTOR3(-138.60f, 10.50f, 1.90f),             //平行移動
	D3DXQUATERNION(-0.10f, 0.03f, 0.02f, 0.99f ),    //回転
	D3DXVECTOR3(3.31f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.05f, 0.19f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-136.56f, 10.12f, -0.62f),             //平行移動
	D3DXQUATERNION(-0.67f, -0.11f, 0.16f, 0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.37f, 0.93f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (1)
{
	D3DXVECTOR3(-129.90f, 10.40f, 5.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.71f, 0.00f, 0.71f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (2)
{
	D3DXVECTOR3(-103.20f, 11.10f, 15.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.69f, 0.00f, 0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.04f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (5)
{
	D3DXVECTOR3(-75.89f, 25.47f, 4.82f),             //平行移動
	D3DXQUATERNION(0.16f, 0.67f, 0.20f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.04f, 0.05f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (6)
{
	D3DXVECTOR3(-74.73f, 25.52f, 4.88f),             //平行移動
	D3DXQUATERNION(0.16f, 0.67f, 0.20f, 0.70f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.04f, 0.05f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-118.22f, 4.42f, 15.61f),             //平行移動
	D3DXQUATERNION(-0.67f, 0.11f, -0.13f, -0.72f ),    //回転
	D3DXVECTOR3(1.02f, 1.00f, 1.03f ),            //拡大
	D3DXVECTOR3(0.02f, -1.00f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall
{
	D3DXVECTOR3(-21.40f, 34.92f, 32.72f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (3)
{
	D3DXVECTOR3(-41.00f, 34.00f, 7.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(12.00f, 2.80f, 12.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (13)
{
	D3DXVECTOR3(-44.08f, 36.36f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (14)
{
	D3DXVECTOR3(-37.98f, 36.36f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (11)
{
	D3DXVECTOR3(-44.08f, 36.36f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (12)
{
	D3DXVECTOR3(-37.98f, 36.36f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet
{
	D3DXVECTOR3(-44.08f, 37.37f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (1)
{
	D3DXVECTOR3(-37.98f, 37.37f, 10.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (2)
{
	D3DXVECTOR3(-44.08f, 37.37f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyBullet (3)
{
	D3DXVECTOR3(-37.98f, 37.37f, 4.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	3,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(28.80f, 47.50f, 35.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	2.00f,//最大移動量
},
//UnMove (8)
{
	D3DXVECTOR3(28.80f, 47.50f, 43.04f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (9)
{
	D3DXVECTOR3(28.80f, 47.50f, 27.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Down
{
	D3DXVECTOR3(20.80f, 47.50f, 35.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	2.00f,//最大移動量
},
//UnMove (4)
{
	D3DXVECTOR3(76.20f, 67.20f, 11.00f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(14.00f, 2.80f, 14.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(12.50f, 33.86f, 35.10f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	14.00f,//最大移動量
},
//DivisionWall (3)
{
	D3DXVECTOR3(-33.20f, 37.20f, 19.33f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (1)
{
	D3DXVECTOR3(6.70f, 34.92f, 32.72f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR
{
	D3DXVECTOR3(3.90f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB
{
	D3DXVECTOR3(3.90f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB
{
	D3DXVECTOR3(3.90f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (1)
{
	D3DXVECTOR3(2.00f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (2)
{
	D3DXVECTOR3(2.00f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (1)
{
	D3DXVECTOR3(2.00f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (2)
{
	D3DXVECTOR3(0.10f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (3)
{
	D3DXVECTOR3(0.10f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (4)
{
	D3DXVECTOR3(0.10f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (5)
{
	D3DXVECTOR3(-5.70f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (6)
{
	D3DXVECTOR3(-5.70f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (3)
{
	D3DXVECTOR3(-5.70f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (4)
{
	D3DXVECTOR3(-3.80f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (7)
{
	D3DXVECTOR3(-3.80f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (8)
{
	D3DXVECTOR3(-3.80f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (9)
{
	D3DXVECTOR3(-1.90f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (10)
{
	D3DXVECTOR3(-1.90f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (5)
{
	D3DXVECTOR3(-1.90f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (6)
{
	D3DXVECTOR3(-13.40f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (11)
{
	D3DXVECTOR3(-13.40f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (12)
{
	D3DXVECTOR3(-13.40f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (13)
{
	D3DXVECTOR3(-15.40f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (14)
{
	D3DXVECTOR3(-15.40f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (7)
{
	D3DXVECTOR3(-15.40f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (8)
{
	D3DXVECTOR3(-17.20f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (15)
{
	D3DXVECTOR3(-17.20f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (16)
{
	D3DXVECTOR3(-17.20f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (17)
{
	D3DXVECTOR3(-11.40f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (18)
{
	D3DXVECTOR3(-11.40f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (9)
{
	D3DXVECTOR3(-11.40f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (10)
{
	D3DXVECTOR3(-9.50f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (19)
{
	D3DXVECTOR3(-9.50f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (20)
{
	D3DXVECTOR3(-9.50f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (21)
{
	D3DXVECTOR3(-7.60f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (22)
{
	D3DXVECTOR3(-7.60f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (11)
{
	D3DXVECTOR3(-7.60f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (23)
{
	D3DXVECTOR3(-19.10f, 34.92f, 36.83f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyFB (24)
{
	D3DXVECTOR3(-19.10f, 34.92f, 33.55f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	1,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//EnemyLR (12)
{
	D3DXVECTOR3(-19.10f, 34.92f, 35.18f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	0,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
//BGM_Changer
{
	D3DXVECTOR3(-41.00f, 36.20f, 7.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(19.11f, 2.14f, 18.46f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	8,//ギミックタイプ
	0.00f,//最大移動量
},
//Up
{
	D3DXVECTOR3(59.80f, 42.80f, 1.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.49f, 0.00f, 0.87f ),    //回転
	D3DXVECTOR3(4.00f, 2.00f, 4.00f ),            //拡大
	D3DXVECTOR3(0.86f, 0.00f, 0.52f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	30.00f,//最大移動量
},
//BGM_Changer (1)
{
	D3DXVECTOR3(76.60f, 68.30f, 11.20f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(23.27f, 2.36f, 22.13f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	8,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (4)
{
	D3DXVECTOR3(29.40f, 50.74f, 23.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (2)
{
	D3DXVECTOR3(86.40f, 70.74f, 3.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (3)
{
	D3DXVECTOR3(92.30f, 70.74f, 7.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (5)
{
	D3DXVECTOR3(88.80f, 70.74f, 11.30f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (6)
{
	D3DXVECTOR3(91.50f, 70.74f, 7.10f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (18)
{
	D3DXVECTOR3(87.60f, 70.02f, 7.90f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (4)
{
	D3DXVECTOR3(-153.50f, 1.60f, -17.10f),             //平行移動
	D3DXQUATERNION(0.00f, 0.85f, 0.00f, 0.52f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.89f, 0.00f, -0.45f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (7)
{
	D3DXVECTOR3(-153.80f, 1.60f, -22.10f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (8)
{
	D3DXVECTOR3(-151.00f, 1.60f, -11.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.32f, 0.00f, 0.95f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.61f, 0.00f, 0.79f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Down
{
	D3DXVECTOR3(-101.70f, 9.20f, 16.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	-1.00f,//最大移動量
},
//UnMove (19)
{
	D3DXVECTOR3(79.10f, 70.02f, 21.60f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (9)
{
	D3DXVECTOR3(82.80f, 70.74f, 21.30f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (10)
{
	D3DXVECTOR3(80.10f, 70.74f, 25.50f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (11)
{
	D3DXVECTOR3(83.60f, 70.74f, 21.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (12)
{
	D3DXVECTOR3(77.70f, 70.74f, 18.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (13)
{
	D3DXVECTOR3(71.00f, 70.74f, 11.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (14)
{
	D3DXVECTOR3(76.90f, 70.74f, 15.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (15)
{
	D3DXVECTOR3(73.40f, 70.74f, 18.90f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (16)
{
	D3DXVECTOR3(76.10f, 70.74f, 14.70f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (20)
{
	D3DXVECTOR3(72.40f, 70.02f, 15.10f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (21)
{
	D3DXVECTOR3(78.30f, 70.02f, 5.60f),             //平行移動
	D3DXQUATERNION(0.00f, -0.27f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(4.00f, 1.00f, 4.00f ),            //拡大
	D3DXVECTOR3(-0.52f, 0.00f, 0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (17)
{
	D3DXVECTOR3(82.20f, 70.74f, 4.80f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (18)
{
	D3DXVECTOR3(79.40f, 70.74f, 9.00f),             //平行移動
	D3DXQUATERNION(0.00f, -0.28f, 0.00f, 0.96f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.55f, 0.00f, 0.84f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (19)
{
	D3DXVECTOR3(83.00f, 70.74f, 5.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall (20)
{
	D3DXVECTOR3(77.10f, 70.74f, 1.60f),             //平行移動
	D3DXQUATERNION(0.00f, 0.48f, 0.00f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.84f, 0.00f, 0.55f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(78.41f, 72.53f, 5.47f),             //平行移動
	D3DXQUATERNION(-0.17f, -0.30f, -0.27f, -0.90f ),    //回転
	D3DXVECTOR3(13.14f, 1.56f, 0.24f ),            //拡大
	D3DXVECTOR3(0.64f, -0.14f, 0.76f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(72.37f, 72.66f, 15.45f),             //平行移動
	D3DXQUATERNION(0.10f, 0.63f, -0.21f, 0.74f ),    //回転
	D3DXVECTOR3(13.64f, 1.33f, 0.37f ),            //拡大
	D3DXVECTOR3(0.89f, -0.41f, 0.18f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(79.23f, 72.41f, 21.68f),             //平行移動
	D3DXQUATERNION(-0.02f, 0.98f, -0.18f, -0.11f ),    //回転
	D3DXVECTOR3(8.35f, 1.35f, 0.80f ),            //拡大
	D3DXVECTOR3(-0.20f, -0.36f, -0.91f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(87.59f, 72.41f, 7.88f),             //平行移動
	D3DXQUATERNION(0.24f, -0.50f, -0.05f, 0.83f ),    //回転
	D3DXVECTOR3(5.08f, 1.49f, 0.97f ),            //拡大
	D3DXVECTOR3(-0.86f, -0.35f, 0.38f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(90.50f, 73.01f, 14.45f),             //平行移動
	D3DXQUATERNION(0.41f, -0.45f, -0.12f, 0.79f ),    //回転
	D3DXVECTOR3(6.58f, 0.19f, 0.37f ),            //拡大
	D3DXVECTOR3(-0.80f, -0.54f, 0.27f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(87.24f, 72.74f, 23.22f),             //平行移動
	D3DXQUATERNION(-0.65f, 0.71f, -0.12f, -0.23f ),    //回転
	D3DXVECTOR3(3.78f, 0.26f, 0.39f ),            //拡大
	D3DXVECTOR3(-0.17f, -0.47f, -0.86f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Up (1)
{
	D3DXVECTOR3(-60.00f, 30.60f, 7.70f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//Move
{
	D3DXVECTOR3(-56.40f, 30.60f, 7.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(2.00f, 1.00f, 2.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.00f),             //Zの向きベクトル
	999,//エネミータイプ
	3,//ギミックタイプ
	3.00f,//最大移動量
},
