//Up
{
	D3DXVECTOR3(0.00f, 1.36f, -2.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(0.00f, 6.20f, 0.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(-0.10f, 7.29f, 7.94f),             //平行移動
	D3DXQUATERNION(-0.47f, 0.50f, -0.50f, -0.53f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.06f, -1.00f, 0.05f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(12.70f, 6.09f, 48.10f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	3.00f,//最大移動量
},
//DivisionWall
{
	D3DXVECTOR3(0.00f, 3.15f, 17.25f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (1)
{
	D3DXVECTOR3(16.20f, 6.09f, 51.80f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (2)
{
	D3DXVECTOR3(19.20f, 6.09f, 54.90f),             //平行移動
	D3DXQUATERNION(0.00f, -0.40f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.73f, 0.00f, 0.69f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall
{
	D3DXVECTOR3(0.00f, 5.60f, 8.38f),             //平行移動
	D3DXQUATERNION(-0.21f, 0.00f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(2.02f, 1.00f, 3.03f ),            //拡大
	D3DXVECTOR3(0.00f, 0.40f, 0.92f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	5.00f,//最大移動量
},
//UnMove (5)
{
	D3DXVECTOR3(0.00f, 2.30f, 13.90f),             //平行移動
	D3DXQUATERNION(0.09f, -0.02f, 0.18f, 0.98f ),    //回転
	D3DXVECTOR3(1.82f, 1.00f, 1.98f ),            //拡大
	D3DXVECTOR3(0.00f, -0.18f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (6)
{
	D3DXVECTOR3(10.00f, 9.00f, 51.70f),             //平行移動
	D3DXQUATERNION(-0.06f, -0.62f, 0.08f, 0.78f ),    //回転
	D3DXVECTOR3(2.28f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.97f, 0.00f, 0.23f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove (7)
{
	D3DXVECTOR3(12.79f, 9.67f, 52.45f),             //平行移動
	D3DXQUATERNION(-0.10f, 0.03f, 0.02f, 0.99f ),    //回転
	D3DXVECTOR3(3.31f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.05f, 0.19f, 0.98f),             //Zの向きベクトル
	999,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(14.78f, 9.28f, 49.89f),             //平行移動
	D3DXQUATERNION(-0.67f, -0.11f, 0.16f, 0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(-0.37f, 0.93f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (1)
{
	D3DXVECTOR3(21.45f, 9.55f, 56.43f),             //平行移動
	D3DXQUATERNION(0.00f, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.71f, 0.00f, 0.71f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//DivisionWall (2)
{
	D3DXVECTOR3(48.13f, 10.27f, 65.90f),             //平行移動
	D3DXQUATERNION(0.00f, 0.69f, 0.00f, 0.72f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(1.00f, 0.00f, 0.04f),             //Zの向きベクトル
	999,//エネミータイプ
	7,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoBall
{
	D3DXVECTOR3(33.15f, 3.64f, 66.13f),             //平行移動
	D3DXQUATERNION(-0.67f, 0.11f, -0.13f, -0.72f ),    //回転
	D3DXVECTOR3(1.02f, 1.00f, 1.03f ),            //拡大
	D3DXVECTOR3(0.02f, -1.00f, 0.08f),             //Zの向きベクトル
	999,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Cube
{
	D3DXVECTOR3(3.00f, 0.00f, -3.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//UnMove
{
	D3DXVECTOR3(132.60f, 12.00f, 69.70f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(15.00f, 1.50f, 15.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	999,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//Boss (2)
{
	D3DXVECTOR3(140.60f, 16.20f, 67.50f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	D3DXVECTOR3(0.00f, 0.00f, 1.00f),             //Zの向きベクトル
	4,//エネミータイプ
	999,//ギミックタイプ
	0.00f,//最大移動量
},
