//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-151.40f, 0.90f, -27.20f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-3
{
	"1-3.x",             //ファイル名
	D3DXVECTOR3(-145.70f, 6.40f, -9.00f),             //平行移動
	D3DXQUATERNION(0.00f, 0.92f, 0.00f, -0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(-151.30f, 0.90f, -17.30f),             //平行移動
	D3DXQUATERNION(0.00f, -1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-125.70f, 6.70f, 10.20f),             //平行移動
	D3DXQUATERNION(0.00f, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-151.40f, 0.40f, -61.80f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-3
{
	"1-3.x",             //ファイル名
	D3DXVECTOR3(-109.20f, 8.50f, 15.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.72f, 0.00f, -0.69f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(-33.20f, 34.10f, 24.80f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(-27.40f, 34.10f, 33.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.92f, 0.00f, -0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-17.50f, 34.10f, 35.21f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-7.60f, 34.10f, 35.21f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(2.30f, 34.10f, 35.21f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(29.40f, 47.40f, 17.40f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(32.30f, 45.40f, 8.30f),             //平行移動
	D3DXQUATERNION(-0.15f, -0.16f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(40.90f, 41.01f, -1.20f),             //平行移動
	D3DXQUATERNION(0.14f, -0.46f, -0.01f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(52.10f, 40.49f, -2.52f),             //平行移動
	D3DXQUATERNION(-0.17f, 0.50f, 0.00f, 0.85f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-90.70f, 14.40f, 1.00f),             //平行移動
	D3DXQUATERNION(-0.89f, 0.01f, -0.43f, 0.14f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-87.60f, 15.70f, 7.90f),             //平行移動
	D3DXQUATERNION(-0.84f, -0.17f, -0.46f, 0.24f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-84.50f, 16.30f, -7.30f),             //平行移動
	D3DXQUATERNION(-0.56f, -0.71f, -0.42f, -0.09f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-78.60f, 18.20f, -0.20f),             //平行移動
	D3DXQUATERNION(-0.40f, -0.63f, -0.59f, -0.30f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-96.50f, 10.50f, 11.00f),             //平行移動
	D3DXQUATERNION(-0.12f, 0.91f, 0.12f, 0.39f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(-92.40f, 16.90f, -7.90f),             //平行移動
	D3DXQUATERNION(-0.09f, 0.02f, -0.99f, 0.04f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-3
{
	"1-3.x",             //ファイル名
	D3DXVECTOR3(-68.90f, 27.30f, 5.70f),             //平行移動
	D3DXQUATERNION(0.14f, -0.70f, -0.17f, 0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
