//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(0.00f, 0.04f, 23.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-3
{
	"1-3.x",             //ファイル名
	D3DXVECTOR3(5.68f, 5.54f, 41.58f),             //平行移動
	D3DXQUATERNION(0.00f, 0.92f, 0.00f, -0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(0.05f, 0.04f, 33.28f),             //平行移動
	D3DXQUATERNION(0.00f, -1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(25.70f, 5.90f, 60.70f),             //平行移動
	D3DXQUATERNION(0.00f, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(0.00f, -0.38f, -11.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-3
{
	"1-3.x",             //ファイル名
	D3DXVECTOR3(42.11f, 7.65f, 65.86f),             //平行移動
	D3DXQUATERNION(0.00f, 0.72f, 0.00f, -0.69f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(142.40f, 12.10f, 84.80f),             //平行移動
	D3DXQUATERNION(0.00f, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-2
{
	"1-2.x",             //ファイル名
	D3DXVECTOR3(148.20f, 12.10f, 93.30f),             //平行移動
	D3DXQUATERNION(0.00f, 0.92f, 0.00f, -0.38f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(158.10f, 12.10f, 95.21f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(168.00f, 12.10f, 95.21f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
//1-1
{
	"1-1.x",             //ファイル名
	D3DXVECTOR3(177.90f, 12.10f, 95.21f),             //平行移動
	D3DXQUATERNION(0.00f, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	999,    //屈折率タイプ
	1.00f,      //透明度
},
